#include <stdio.h>
#include <math.h>

int main()
{
	double x, y; // Обьявляем переменные, типа double
	printf("x:\t"); // Выводим на экран "x:"
	scanf("%lf", &x); // Сохраняем введенное с клавиатуры значение в переменную x
	printf("y:\t"); // Выводим на экран "x:"
	scanf("%lf", &y); // Сохраняем введенное с клавиатуры значение в переменную y
  printf("f = %.5lf", (x > 0) ? x - fabs(y) : (y < 0) ? y * y - x : ++y); // Сложный тернарный оператор, состоит из двух условий (x>0) => x- модуль(y), (y<0) => y*y-x, иначе инкремент(y))
	return 0;
}
