#include <stdio.h>
#include <math.h>

int asdasd()
{
	int a, b; // Обьявляем переменные, тип double
  printf("a:\t"); // Выводим на экран "a:"
  scanf("%d", &a); // Записываем введенное значение в переменную a
  printf("b:\t"); // Выводим на экран "b:"
  scanf("%d", &b); // Записываем введенное значение в переменную b
  if (a == 0 || b == 0) // Условие
  {
    printf("Значения переменных не были изменены\n"); // Вывод сообщения на экран
  } else { // Иначе
    if (a < 0 && b < 0) { // Условие
      a--; // Декремент
      b++; // Инкремент
    } 
    else if (a > 0 && b > 0) { // Иначе если
      (a > b) ? (a *= 2, b *= 3): (b *= 2, a *= 3); // Тернарный оператор
    }
    else { // Иначе
      (a > b) ? (b = fabs(b)) : (a = fabs(a)); // Тернарный оператор
    }
  }
  printf("a:\t%d\nb:\t%d", a, b); // Вывод значений переменных на экран
	return 0;
}