#include <stdio.h>
#include <math.h>

int madf()
{
	double x, ctg; // Обьявляем две переменные, тип double
  printf("x:\t"); // Выводим на экран "x:"
  scanf("%lf", &x); // Записываем введенное значение в переменную x
  if (x > 0) { // Условие (если x>0)
    ctg = 1/tan(x); // Присваиваем значение переменной ctg
    printf("S = %lf", (ctg - exp(sqrt(x))) / (log(fabs(5 * x)) + (atan(x) * atan(x)))); // Выводим значение переменной S, выполняя математические действия
  } else { // Иначе
    printf("Заданное значение переменной x не соответсвует ООФ (x > 0)"); // Выводим сообщение пользователю
  }
	return 0;
}
